app/Http/Controllers/HobbyController.php

    public function index()
    {
        //$hobbies = Hobby::all();
        //$hobbies = Hobby::paginate(10);


        $meldg_success = Session::get('meldg_success');

        $hobbies = Hobby::orderBy('created_at', 'DESC')->paginate(10);
---
select * from `hobbies` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `hobbies`

    public function show(Hobby $hobby)
    {

        $alleTags = Tag::all(); // Alle Tags holen
        $verwendeteTags = $hobby->tags;
        $verfuegbareTags = $alleTags->diff($verwendeteTags);

        $meldg_success = Session::get('meldg_success');
        $meldg_hinweis = Session::get('meldg_hinweis');

        return view('hobby.show')->with(
            [
                'hobby' => $hobby,
                'meldg_success' => $meldg_success,
                'meldg_hinweis' => $meldg_hinweis,
                'verfuegbareTags' => $verfuegbareTags
            ]
        );
---
select * from `tags`
select `tags`.*, `hobby_tag`.`hobby_id` as `pivot_hobby_id`, `hobby_tag`.`tag_id` as `pivot_tag_id` from `tags` inner join `hobby_tag` on `tags`.`id` = `hobby_tag`.`tag_id` where `hobby_tag`.`hobby_id` = 422